[Killed] ConditionalExpression
src/application/bookmarks.ts:18:70
       has: (id) => get().ids.includes(id),
       // 🛡️ L4 Fix: Проверяем наличие перед добавлением
       add: (id) => set((state) => (state.ids.includes(id) ? state : { ids: [...state.ids, id] })),
-      remove: (id) => set((state) => ({ ids: state.ids.filter((i) => i !== id) })),
+      remove: (id) => set((state) => ({ ids: state.ids.filter((i) => false) })),
     }),
     { name: 'bookmarks-storage' },
killedBy: Bookmarks Store removes non-existent item safely
statusReason: expected [] to deeply equal [ 'id-1' ]

[Killed] ArrowFunction
src/application/bookmarks.ts:18:63
       has: (id) => get().ids.includes(id),
       // 🛡️ L4 Fix: Проверяем наличие перед добавлением
       add: (id) => set((state) => (state.ids.includes(id) ? state : { ids: [...state.ids, id] })),
-      remove: (id) => set((state) => ({ ids: state.ids.filter((i) => i !== id) })),
+      remove: (id) => set((state) => ({ ids: state.ids.filter(() => undefined) })),
     }),
     { name: 'bookmarks-storage' },
killedBy: Bookmarks Store removes non-existent item safely
statusReason: expected [] to deeply equal [ 'id-1' ]
