[Killed] BlockStatement
src/application/ritual-store.ts:18:28
   loading: false,
   error: null,
 
-  fetchRitual: async () => {
-    set({ loading: true, error: null });
-
-    try {
-      const data = await getRitualCached();
-      set({ ritualItem: data, loading: false });
-    } catch (err) {
-      console.error('Store Error:', err);
-      set({
-        error: err instanceof Error ? err.message : 'Неизвестная ошибка загрузки',
-        loading: false,
-      });
-    }
-  },
+  fetchRitual: async () => {},
 }));
 
killedBy: Ritual Store fetches ritual successfully
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/application/ritual-store.ts:21:9
   fetchRitual: async () => {
     set({ loading: true, error: null });
 
-    try {
-      const data = await getRitualCached();
-      set({ ritualItem: data, loading: false });
-    } catch (err) {
+    try {} catch (err) {
       console.error('Store Error:', err);
       set({
killedBy: Ritual Store fetches ritual successfully
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/application/ritual-store.ts:23:11
 
     try {
       const data = await getRitualCached();
-      set({ ritualItem: data, loading: false });
+      set({});
     } catch (err) {
       console.error('Store Error:', err);
killedBy: Ritual Store fetches ritual successfully
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/application/ritual-store.ts:24:19
     try {
       const data = await getRitualCached();
       set({ ritualItem: data, loading: false });
-    } catch (err) {
-      console.error('Store Error:', err);
-      set({
-        error: err instanceof Error ? err.message : 'Неизвестная ошибка загрузки',
-        loading: false,
-      });
-    }
+    } catch (err) {}
   },
 }));
killedBy: Ritual Store handles fetch error
statusReason: expected true to be false // Object.is equality
