[NoCoverage] BlockStatement
src/infrastructure/storage.ts:13:13
   set(key: string, value: unknown) {
     try {
       localStorage.setItem(key, JSON.stringify(value));
-    } catch {
-      void 0; // quota/offline — игнорируем
-    }
+    } catch {}
   },
   del(key: string) {

[Killed] BlockStatement
src/infrastructure/storage.ts:17:20
       void 0; // quota/offline — игнорируем
     }
   },
-  del(key: string) {
-    try {
-      localStorage.removeItem(key);
-    } catch {
-      void 0; // приватный режим/ограничения — игнорируем
-    }
-  },
+  del(key: string) {},
 };
 
killedBy: Infrastructure: storage should delete a value
statusReason: expected { id: 1 } to be null

[Killed] BlockStatement
src/infrastructure/storage.ts:18:9
     }
   },
   del(key: string) {
-    try {
-      localStorage.removeItem(key);
-    } catch {
+    try {} catch {
       void 0; // приватный режим/ограничения — игнорируем
     }
killedBy: Infrastructure: storage should delete a value
statusReason: expected { id: 1 } to be null
