[Killed] BlockStatement
src/infrastructure/utils/share.ts:37:32
 ];
 
 function stripParams(u: URL): URL {
-  for (const p of JUNK_PARAMS) {
-    u.searchParams.delete(p);
-  }
+  for (const p of JUNK_PARAMS) {}
   // [UEC REFACTOR]: Удален избыточный блок ручной очистки u.search.
   // URL API автоматически обрабатывает пустые searchParams корректно.
killedBy: normalizeShareUrl uses canonical when provided
statusReason: expected 'https://example.com/canonical?utm_med…' to be 'https://example.com/canonical' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/utils/share.ts:52:12
 export function __hrefOrExample(): string {
   try {
     // biome-ignore lint/suspicious/noExplicitAny: safe access to window in SSR check
-    return typeof window !== 'undefined' && (window as any).location
+    return false
       ? // biome-ignore lint/suspicious/noExplicitAny: safe access
         (window as any).location.href
killedBy: normalizeShareUrl handles relative paths
statusReason: expected 'https://example.com/relative/path' to be 'https://app.example.com/relative/path' // Object.is equality

[Survived] LogicalOperator
src/infrastructure/utils/share.ts:52:12
 export function __hrefOrExample(): string {
   try {
     // biome-ignore lint/suspicious/noExplicitAny: safe access to window in SSR check
-    return typeof window !== 'undefined' && (window as any).location
+    return typeof window !== 'undefined' || (window as any).location
       ? // biome-ignore lint/suspicious/noExplicitAny: safe access
         (window as any).location.href

[Killed] EqualityOperator
src/infrastructure/utils/share.ts:65:12
 export function __hrefOrEmpty(): string {
   try {
     // biome-ignore lint/suspicious/noExplicitAny: safe access to window in SSR check
-    return typeof window !== 'undefined' && (window as any).location
+    return typeof window === 'undefined' && (window as any).location
       ? // biome-ignore lint/suspicious/noExplicitAny: safe access
         (window as any).location.href
killedBy: share internal helpers (SSR-safe) returns current href when window is available
statusReason: expected '' to be 'https://app.example.com/current' // Object.is equality

[Survived] MethodExpression
src/infrastructure/utils/share.ts:76:18
 
 export function normalizeShareUrl(raw: string, canonicalUrl?: string): string {
   try {
-    const base = canonicalUrl?.trim() ? canonicalUrl : raw;
+    const base = canonicalUrl ? canonicalUrl : raw;
 
     try {

[Killed] LogicalOperator
src/infrastructure/utils/share.ts:109:19
 export async function shareLink(url?: string, title?: string): Promise<boolean> {
   const shareUrl = buildItemShareUrl({
     canonicalUrl: getCanonicalFromDocument(),
-    fallbackHref: url || window.location.href,
+    fallbackHref: url && window.location.href,
   });
 
killedBy: shareLink uses Telegram WebApp when available
statusReason: expected "vi.fn()" to be called with arguments: [ 'https://example.com/' ]

Received: 

  1st vi.fn() call:

  [
-   "https://example.com/",

[Killed] BlockStatement
src/infrastructure/utils/share.ts:118:7
   const nav = navigator as MaybeShareNavigator;
 
   // 1) Telegram WebApp
-  try {
-    if (tg?.shareURL) {
-      tg.shareURL(finalShareUrl);
-      return true;
-    }
-  } catch {
+  try {} catch {
     /* ignore */
   }
killedBy: shareLink uses Telegram WebApp when available
statusReason: expected "vi.fn()" to be called with arguments: [ 'https://example.com/' ]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/utils/share.ts:119:23
 
   // 1) Telegram WebApp
   try {
-    if (tg?.shareURL) {
-      tg.shareURL(finalShareUrl);
-      return true;
-    }
+    if (tg?.shareURL) {}
   } catch {
     /* ignore */
killedBy: shareLink uses Telegram WebApp when available
statusReason: expected "vi.fn()" to be called with arguments: [ 'https://example.com/' ]

Number of calls: 0

[Survived] ConditionalExpression
src/infrastructure/utils/share.ts:129:9
 
   // 2) Web Share API
   try {
-    if (nav.share) {
+    if (true) {
       await nav.share({ url: finalShareUrl, title });
       return true;

[Killed] ObjectLiteral
src/infrastructure/utils/share.ts:130:23
   // 2) Web Share API
   try {
     if (nav.share) {
-      await nav.share({ url: finalShareUrl, title });
+      await nav.share({});
       return true;
     }
killedBy: shareLink uses Web Share API when Telegram not available
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Received: 

  1st vi.fn() call:

  [
-   {

[Killed] BooleanLiteral
src/infrastructure/utils/share.ts:131:14
   try {
     if (nav.share) {
       await nav.share({ url: finalShareUrl, title });
-      return true;
+      return false;
     }
   } catch {
killedBy: shareLink uses Web Share API when Telegram not available
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/infrastructure/utils/share.ts:144:27
       tg?.showPopup?.({
         title: 'Скопировано',
         message: 'Ссылка скопирована в буфер обмена.',
-        buttons: [{ type: 'ok' }],
+        buttons: [{ type: "" }],
       });
       return true;
killedBy: shareLink uses clipboard when other methods fail
statusReason: expected "vi.fn()" to be called with arguments: [ { title: 'Скопировано', …(2) } ]

Received: 

  1st vi.fn() call:

@@ -1,10 +1,10 @@
  [

[Killed] LogicalOperator
src/infrastructure/utils/share.ts:167:12
   try {
     // biome-ignore lint/security/noSecrets: CSS selector
     const link = document.querySelector('link[rel="canonical"]') as HTMLLinkElement | null;
-    return link?.href || undefined;
+    return link?.href && undefined;
   } catch {
     return undefined;
killedBy: shareLink canonical & fallback behaviour prefers canonical link from document when sharing
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "https://canonical.example/ritual-of-day",

[Survived] StringLiteral
src/infrastructure/utils/share.ts:178:12
     const url = new URL(window.location.href);
     return `${url.origin}${url.pathname}`;
   } catch {
-    return '';
+    return "Stryker was here!";
   }
 }
