[Killed] ConditionalExpression
src/application/api/ritual-client.ts:17:21
   const now = Date.now();
 
   // 1. Проверка кэша по TTL
-  if (cachedData && now - lastFetchTime < CACHE_TTL_MS) {
+  if (cachedData && true) {
     console.log('🔄 Возвращаем ритуал из кэша (без запроса к сети)');
     return cachedData;
killedBy: Ritual Client (Caching Strategy) Full flow: fetch -> cache hit -> ttl expire -> network fail -> stale cache
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] EqualityOperator
src/application/api/ritual-client.ts:17:21
   const now = Date.now();
 
   // 1. Проверка кэша по TTL
-  if (cachedData && now - lastFetchTime < CACHE_TTL_MS) {
+  if (cachedData && now - lastFetchTime <= CACHE_TTL_MS) {
     console.log('🔄 Возвращаем ритуал из кэша (без запроса к сети)');
     return cachedData;
killedBy: Ritual Client (Caching Strategy) Boundary: Refetches exactly at CACHE_TTL limit
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/application/api/ritual-client.ts:23:7
   }
 
   // 2. Искусственный лаг сети (выключен в тестах через NODE_ENV)
-  if (process.env.NODE_ENV !== 'test') {
+  if (process.env.NODE_ENV === 'test') {
     await new Promise((resolve) => setTimeout(resolve, 400));
   }
killedBy: Ritual Client (Caching Strategy) Full flow: fetch -> cache hit -> ttl expire -> network fail -> stale cache
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] BlockStatement
src/application/api/ritual-client.ts:23:40
   }
 
   // 2. Искусственный лаг сети (выключен в тестах через NODE_ENV)
-  if (process.env.NODE_ENV !== 'test') {
-    await new Promise((resolve) => setTimeout(resolve, 400));
-  }
+  if (process.env.NODE_ENV !== 'test') {}
 
   try {

[Killed] BooleanLiteral
src/application/api/ritual-client.ts:31:9
     // 3. Запрос к статическому файлу
     const res = await fetch('/rituals.json');
 
-    if (!res.ok) {
+    if (res.ok) {
       throw new Error(`HTTP error! status: ${res.status}`);
     }
killedBy: Ritual Client (Caching Strategy) Full flow: fetch -> cache hit -> ttl expire -> network fail -> stale cache
statusReason: Не удалось загрузить ритуал. Проверьте связь с космосом.

[Killed] BlockStatement
src/application/api/ritual-client.ts:31:18
     // 3. Запрос к статическому файлу
     const res = await fetch('/rituals.json');
 
-    if (!res.ok) {
-      throw new Error(`HTTP error! status: ${res.status}`);
-    }
+    if (!res.ok) {}
 
     const json = (await res.json()) as RitualResponse;
killedBy: Ritual Client Gaps throws error on 404/500 without cache
statusReason: expected "error" to be called with arguments: [ 'Data Fetch Error:', …(1) ]

Received: 

  1st error call:

  [
    "Data Fetch Error:",
