[NoCoverage] StringLiteral
src/ui/Header.tsx:1:34
-export function Header({ title = 'Prisma Ritual AI' }: { title?: string }) {
+export function Header({ title = "" }: { title?: string }) {
   return (
     <header className="sticky top-0 z-20 backdrop-blur-lg bg-bg/80 border-b border-white/10">
