[Killed] BlockStatement
src/infrastructure/utils/nav.ts:15:21
   const tg = (globalThis as TelegramGlobal).Telegram?.WebApp;
 
   // Внутри Telegram: откроем нативно (Instant View, если доступен)
-  if (tg?.openLink) {
-    try {
-      tg.openLink(url, { try_instant_view: true });
-      return;
-    } catch {
-      // Если Telegram WebApp выбросил ошибку, продолжаем к обычным методам
-      // Не логируем ошибку, чтобы не засорять консоль пользователя
-    }
-  }
+  if (tg?.openLink) {}
 
   // Обычный браузер: пытаемся новое окно, иначе — в этом же окне
killedBy: openLink should use Telegram WebApp openLink when available
statusReason: expected "vi.fn()" to be called with arguments: [ 'https://example.com', …(1) ]

Number of calls: 0

[Killed] BooleanLiteral
src/infrastructure/utils/nav.ts:17:44
   // Внутри Telegram: откроем нативно (Instant View, если доступен)
   if (tg?.openLink) {
     try {
-      tg.openLink(url, { try_instant_view: true });
+      tg.openLink(url, { try_instant_view: false });
       return;
     } catch {
killedBy: openLink should use Telegram WebApp openLink when available
statusReason: expected "vi.fn()" to be called with arguments: [ 'https://example.com', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "https://example.com",

[Killed] BlockStatement
src/infrastructure/utils/nav.ts:26:38
   }
 
   // Обычный браузер: пытаемся новое окно, иначе — в этом же окне
-  if (typeof window !== 'undefined') {
-    try {
-      const win = window.open(url, '_blank', 'noopener,noreferrer');
-      if (!win && window.location) {
-        window.location.assign(url);
-      }
-    } catch {
-      // Игнорируем ошибки открытия ссылок
-    }
-  }
+  if (typeof window !== 'undefined') {}
 }
 
killedBy: openLink should use window.open when Telegram is not available
statusReason: expected "vi.fn()" to be called with arguments: [ 'https://example.com', …(2) ]

Number of calls: 0

[Survived] ConditionalExpression
src/infrastructure/utils/nav.ts:26:7
   }
 
   // Обычный браузер: пытаемся новое окно, иначе — в этом же окне
-  if (typeof window !== 'undefined') {
+  if (true) {
     try {
       const win = window.open(url, '_blank', 'noopener,noreferrer');

[Killed] BlockStatement
src/infrastructure/utils/nav.ts:27:9
 
   // Обычный браузер: пытаемся новое окно, иначе — в этом же окне
   if (typeof window !== 'undefined') {
-    try {
-      const win = window.open(url, '_blank', 'noopener,noreferrer');
-      if (!win && window.location) {
-        window.location.assign(url);
-      }
-    } catch {
+    try {} catch {
       // Игнорируем ошибки открытия ссылок
     }
killedBy: openLink should use window.open when Telegram is not available
statusReason: expected "vi.fn()" to be called with arguments: [ 'https://example.com', …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/utils/nav.ts:29:11
   if (typeof window !== 'undefined') {
     try {
       const win = window.open(url, '_blank', 'noopener,noreferrer');
-      if (!win && window.location) {
+      if (false) {
         window.location.assign(url);
       }
killedBy: openLink should fallback to location.assign when window.open returns null
statusReason: expected "vi.fn()" to be called with arguments: [ 'https://example.com' ]

Number of calls: 0
