[Survived] LogicalOperator
src/infrastructure/tts.ts:5:3
 
 // Безопасная ссылка на SpeechSynthesis (в браузере)
 const synth: SpeechSynthesis | null =
-  typeof window !== 'undefined' &&
-  // biome-ignore lint/security/noSecrets: 'speechSynthesis' — имя Web API, а не секрет
-  'speechSynthesis' in window
+  typeof window !== 'undefined' ||
+// biome-ignore lint/security/noSecrets: 'speechSynthesis' — имя Web API, а не секрет
+'speechSynthesis' in window
     ? window.speechSynthesis
     : null;

[Survived] ConditionalExpression
src/infrastructure/tts.ts:5:3
 
 // Безопасная ссылка на SpeechSynthesis (в браузере)
 const synth: SpeechSynthesis | null =
-  typeof window !== 'undefined' &&
-  // biome-ignore lint/security/noSecrets: 'speechSynthesis' — имя Web API, а не секрет
-  'speechSynthesis' in window
+  true
     ? window.speechSynthesis
     : null;

[Killed] BlockStatement
src/infrastructure/tts.ts:21:7
   if (!synth) {
     return;
   }
-  try {
-    synth.cancel();
-  } catch (error) {
+  try {} catch (error) {
     console.error('TTS error during cancel:', error);
   }
killedBy: application TTS integration (mutation) uses window.speechSynthesis and builds correct utterance text
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/infrastructure/tts.ts:23:19
   }
   try {
     synth.cancel();
-  } catch (error) {
-    console.error('TTS error during cancel:', error);
-  }
+  } catch (error) {}
 }
 
killedBy: application TTS integration (mutation) swallows cancel/speak errors and logs them
statusReason: expected "error" to be called with arguments: [ 'TTS error during cancel:', …(1) ]

Number of calls: 0

[Killed] MethodExpression
src/infrastructure/tts.ts:38:16
   stop();
 
   // Удаляем все теги
-  const body = html.replace(/<[^>]*>/g, '').trim();
+  const body = html.replace(/<[^>]*>/g, '');
   const text = (title ? `${title}. ` : '') + body;
 
killedBy: application TTS integration (mutation) does not call speak when cleaned text is empty
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      FakeUtterance {

[Killed] StringLiteral
src/infrastructure/tts.ts:39:40
 
   // Удаляем все теги
   const body = html.replace(/<[^>]*>/g, '').trim();
-  const text = (title ? `${title}. ` : '') + body;
+  const text = (title ? `${title}. ` : "Stryker was here!") + body;
 
   if (!text) {
killedBy: application TTS integration (mutation) does not call speak when cleaned text is empty
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      FakeUtterance {

[Killed] BooleanLiteral
src/infrastructure/tts.ts:41:7
   const body = html.replace(/<[^>]*>/g, '').trim();
   const text = (title ? `${title}. ` : '') + body;
 
-  if (!text) {
+  if (text) {
     return;
   }
killedBy: application TTS integration (mutation) uses window.speechSynthesis and builds correct utterance text
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/infrastructure/tts.ts:50:19
 
   try {
     synth.speak(utter);
-  } catch (error) {
-    console.error('TTS error during speak:', error);
-  }
+  } catch (error) {}
 }
 
killedBy: application TTS integration (mutation) swallows cancel/speak errors and logs them
statusReason: expected "error" to be called with arguments: [ 'TTS error during speak:', …(1) ]

Received: 

  1st error call:

  [
-   "TTS error during speak:",
