[Killed] BlockStatement
src/infrastructure/utils/reportError.ts:2:85
 // src/utils/reportError.ts
-export async function reportError(err: unknown, meta: Record<string, unknown> = {}) {
-  const safeMeta = meta && typeof meta === 'object' ? meta : {};
-
-  const payload = {
-    message: err instanceof Error ? err.message : String(err),
-    stack: err instanceof Error ? err.stack : undefined,
-    meta: safeMeta, // <= гарантируем наличие поля meta
-    userAgent: typeof navigator !== 'undefined' ? navigator.userAgent : undefined,
-    url: typeof location !== 'undefined' ? location.href : undefined,
-  };
-
-  try {
-    await fetch('/api/report-error', {
-      method: 'POST',
-      headers: { 'content-type': 'application/json' },
-      body: JSON.stringify(payload),
-    });
-  } catch {
-    // не роняем клиент из-за телеметрии
-  }
-}
+export async function reportError(err: unknown, meta: Record<string, unknown> = {}) {}
 
killedBy: reportError (edgecases to 100%) serializes Error when UA/URL are absent
statusReason: expected "fetch" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/infrastructure/utils/reportError.ts:3:28
 // src/utils/reportError.ts
 export async function reportError(err: unknown, meta: Record<string, unknown> = {}) {
-  const safeMeta = meta && typeof meta === 'object' ? meta : {};
+  const safeMeta = meta && typeof meta !== 'object' ? meta : {};
 
   const payload = {
killedBy: reportError (edgecases to 100%) should handle invalid (string) meta correctly
statusReason: expected 'i-am-a-string' to deeply equal {}

[Killed] ObjectLiteral
src/infrastructure/utils/reportError.ts:5:19
 export async function reportError(err: unknown, meta: Record<string, unknown> = {}) {
   const safeMeta = meta && typeof meta === 'object' ? meta : {};
 
-  const payload = {
-    message: err instanceof Error ? err.message : String(err),
-    stack: err instanceof Error ? err.stack : undefined,
-    meta: safeMeta, // <= гарантируем наличие поля meta
-    userAgent: typeof navigator !== 'undefined' ? navigator.userAgent : undefined,
-    url: typeof location !== 'undefined' ? location.href : undefined,
-  };
+  const payload = {};
 
   try {
killedBy: reportError (edgecases to 100%) serializes Error when UA/URL are absent
statusReason: expected undefined to be 'No env branches' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/utils/reportError.ts:9:16
     message: err instanceof Error ? err.message : String(err),
     stack: err instanceof Error ? err.stack : undefined,
     meta: safeMeta, // <= гарантируем наличие поля meta
-    userAgent: typeof navigator !== 'undefined' ? navigator.userAgent : undefined,
+    userAgent: false ? navigator.userAgent : undefined,
     url: typeof location !== 'undefined' ? location.href : undefined,
   };
killedBy: reportError (branches) handles non-Error input and non-object meta (coerces to {})
statusReason: expected undefined to be 'jest-jsdom UA' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/utils/reportError.ts:10:10
     stack: err instanceof Error ? err.stack : undefined,
     meta: safeMeta, // <= гарантируем наличие поля meta
     userAgent: typeof navigator !== 'undefined' ? navigator.userAgent : undefined,
-    url: typeof location !== 'undefined' ? location.href : undefined,
+    url: true ? location.href : undefined,
   };
 
killedBy: reportError (edgecases to 100%) serializes Error when UA/URL are absent
statusReason: promise rejected "ReferenceError: location is not defined" instead of resolving

[Killed] ConditionalExpression
src/infrastructure/utils/reportError.ts:10:10
     stack: err instanceof Error ? err.stack : undefined,
     meta: safeMeta, // <= гарантируем наличие поля meta
     userAgent: typeof navigator !== 'undefined' ? navigator.userAgent : undefined,
-    url: typeof location !== 'undefined' ? location.href : undefined,
+    url: false ? location.href : undefined,
   };
 
killedBy: reportError (branches) handles non-Error input and non-object meta (coerces to {})
statusReason: expected undefined to be 'http://localhost/test' // Object.is equality

[Killed] StringLiteral
src/infrastructure/utils/reportError.ts:15:15
 
   try {
     await fetch('/api/report-error', {
-      method: 'POST',
+      method: "",
       headers: { 'content-type': 'application/json' },
       body: JSON.stringify(payload),
killedBy: reportError (basic happy-path) sends serialized error to /api/report-error with POST
statusReason: expected '' to be 'POST' // Object.is equality
