[Killed] BlockStatement
src/infrastructure/utils/useDebouncedValue.ts:3:61
 import { useEffect, useState } from 'react';
 
-export function useDebouncedValue<T>(value: T, delay = 300) {
-  const [v, setV] = useState<T>(value);
-  useEffect(() => {
-    const id = setTimeout(() => setV(value), delay);
-    return () => clearTimeout(id);
-  }, [value, delay]);
-  return v;
-}
+export function useDebouncedValue<T>(value: T, delay = 300) {}
 
killedBy: useDebouncedValue hook returns the initial value immediately
statusReason: expected undefined to be 'initial' // Object.is equality

[Killed] BlockStatement
src/infrastructure/utils/useDebouncedValue.ts:5:19
 
 export function useDebouncedValue<T>(value: T, delay = 300) {
   const [v, setV] = useState<T>(value);
-  useEffect(() => {
-    const id = setTimeout(() => setV(value), delay);
-    return () => clearTimeout(id);
-  }, [value, delay]);
+  useEffect(() => {}, [value, delay]);
   return v;
 }
killedBy: useDebouncedValue hook updates value after the delay passes
statusReason: expected 'initial' to be 'updated' // Object.is equality

[Killed] ArrowFunction
src/infrastructure/utils/useDebouncedValue.ts:6:27
 export function useDebouncedValue<T>(value: T, delay = 300) {
   const [v, setV] = useState<T>(value);
   useEffect(() => {
-    const id = setTimeout(() => setV(value), delay);
+    const id = setTimeout(() => undefined, delay);
     return () => clearTimeout(id);
   }, [value, delay]);
killedBy: useDebouncedValue hook updates value after the delay passes
statusReason: expected 'initial' to be 'updated' // Object.is equality

[Killed] ArrayDeclaration
src/infrastructure/utils/useDebouncedValue.ts:8:6
   useEffect(() => {
     const id = setTimeout(() => setV(value), delay);
     return () => clearTimeout(id);
-  }, [value, delay]);
+  }, []);
   return v;
 }
killedBy: useDebouncedValue hook updates value after the delay passes
statusReason: expected 'initial' to be 'updated' // Object.is equality
