[Survived] StringLiteral
src/ui/RitualCard.tsx:41:20
       <button
         type="button"
         onClick={toggle}
-        className={`mt-10 w-full py-4 rounded-xl font-bold tracking-wide transition-all duration-300 ${
-          isBookmarked
-            ? 'bg-purple-600 text-white shadow-[0_0_20px_rgba(147,51,234,0.5)]'
-            : 'bg-white/5 hover:bg-white/10 text-white/80'
-        }`}
+        className={``}
       >
         {isBookmarked ? '★ Сохранено' : '☆ Сохранить Ритуал'}
