[Killed] BlockStatement
src/ui/AppShell.tsx:16:14
   }, [fetchRitual]);
 
   // Простой вывод ошибки без лишних компонентов
-  if (error) {
-    return (
-      <div className="min-h-screen bg-gray-900 text-white p-10 text-center flex flex-col items-center justify-center">
-        <h2 className="text-2xl text-red-400 mb-4">Ошибка</h2>
-        <p className="mb-6">{error}</p>
-        <button
-          type="button"
-          onClick={() => fetchRitual()}
-          className="px-6 py-2 bg-white/10 rounded-full hover:bg-white/20"
-        >
-          Попробовать снова
-        </button>
-      </div>
-    );
-  }
+  if (error) {}
 
   return (
killedBy: AppShell Integration показывает ошибку и кнопку повтора
statusReason: Unable to find an element with the text: Сбой связи. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="min-h-screen bg-gradient-to-br from-purple-900 via-blue-900 to-indigo-900 text-white"
    >

[Killed] BooleanLiteral
src/ui/AppShell.tsx:37:10
       <Header title="Prisma Ritual AI" />
       <main className="container mx-auto px-4 py-12">
         {loading && <div className="text-center text-3xl animate-pulse">Загрузка...</div>}
-        {!loading && ritualItem && <RitualCard item={ritualItem} />}
+        {loading && ritualItem && <RitualCard item={ritualItem} />}
       </main>
       <footer className="text-center py-8 text-sm opacity-70">© 2025 Prisma Ritual AI</footer>
killedBy: AppShell Integration рендерит ритуал
statusReason: Unable to find an element with the text: Тестовый Ритуал. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="min-h-screen bg-gradient-to-br from-purple-900 via-blue-900 to-indigo-900 text-white"
    >
