[Killed] BlockStatement
src/infrastructure/utils/useTTSState.ts:9:44
   const canTTS = isSupported();
 
   const start = useCallback(
-    async (title: string, html: string) => {
-      if (!canTTS) {
-        return;
-      }
-      setIsSpeaking(true);
-      try {
-        await speakFromHtml(title, html);
-      } finally {
-        // даже если ошибка/прерывание — вернуть кнопку в исходное состояние
-        setIsSpeaking(false);
-      }
-    },
+    async (title: string, html: string) => {},
     [canTTS],
   );
killedBy: useTTSState mutation start delegates to speakFromHtml when supported and resets isSpeaking after completion
statusReason: expected "vi.fn()" to be called with arguments: [ 'Title', '<p>Body</p>' ]

Number of calls: 0

[Killed] BooleanLiteral
src/infrastructure/utils/useTTSState.ts:10:11
 
   const start = useCallback(
     async (title: string, html: string) => {
-      if (!canTTS) {
+      if (canTTS) {
         return;
       }
killedBy: useTTSState mutation start delegates to speakFromHtml when supported and resets isSpeaking after completion
statusReason: expected "vi.fn()" to be called with arguments: [ 'Title', '<p>Body</p>' ]

Number of calls: 0

[Killed] BooleanLiteral
src/infrastructure/utils/useTTSState.ts:13:21
       if (!canTTS) {
         return;
       }
-      setIsSpeaking(true);
+      setIsSpeaking(false);
       try {
         await speakFromHtml(title, html);
killedBy: useTTSState mutation sets isSpeaking to true while speaking
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/infrastructure/utils/useTTSState.ts:14:11
         return;
       }
       setIsSpeaking(true);
-      try {
-        await speakFromHtml(title, html);
-      } finally {
+      try {} finally {
         // даже если ошибка/прерывание — вернуть кнопку в исходное состояние
         setIsSpeaking(false);
killedBy: useTTSState mutation start delegates to speakFromHtml when supported and resets isSpeaking after completion
statusReason: expected "vi.fn()" to be called with arguments: [ 'Title', '<p>Body</p>' ]

Number of calls: 0

[Killed] BooleanLiteral
src/infrastructure/utils/useTTSState.ts:26:19
 
   const halt = useCallback(() => {
     stop();
-    setIsSpeaking(false);
+    setIsSpeaking(true);
   }, []);
 
killedBy: useTTSState mutation halt and unmount call stop to ensure playback is halted
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/infrastructure/utils/useTTSState.ts:30:19
   }, []);
 
   // На размонтировании / смене экрана — гарантированно остановим озвучку
-  useEffect(() => () => stop(), []);
+  useEffect(() => () => undefined, []);
 
   return { canTTS, isSpeaking, start, halt };
killedBy: useTTSState mutation halt and unmount call stop to ensure playback is halted
statusReason: expected 1 to be greater than 1
