[Killed] BlockStatement
src/infrastructure/utils/tg.ts:30:40
  * Безопасная и необязательная инициализация Telegram WebApp.
  * Если API нет — просто выходим. Любые ошибки глушим.
  */
-export function initTelegramUI(): void {
-  try {
-    // SSR-safe проверка: если окна нет, выходим
-    if (typeof window === 'undefined') {
-      return;
-    }
-
-    // Теперь TS знает, что у window есть Telegram, кастовать (as unknown) не нужно!
-    const webApp = window.Telegram?.WebApp;
-
-    if (!webApp) {
-      return;
-    }
-
-    // Минимальные безопасные вызовы
-    webApp.ready?.();
-
-    // Остальные методы можно дергать по месту при необходимости:
-    // webApp.expand?.();
-  } catch {
-    // Мост НЕ должен ломать первый рендер UI
-  }
-}
+export function initTelegramUI(): void {}
 
killedBy: Telegram UI calls ready() if Telegram API is available
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/infrastructure/utils/tg.ts:31:7
  * Если API нет — просто выходим. Любые ошибки глушим.
  */
 export function initTelegramUI(): void {
-  try {
-    // SSR-safe проверка: если окна нет, выходим
-    if (typeof window === 'undefined') {
-      return;
-    }
-
-    // Теперь TS знает, что у window есть Telegram, кастовать (as unknown) не нужно!
-    const webApp = window.Telegram?.WebApp;
-
-    if (!webApp) {
-      return;
-    }
-
-    // Минимальные безопасные вызовы
-    webApp.ready?.();
-
-    // Остальные методы можно дергать по месту при необходимости:
-    // webApp.expand?.();
-  } catch {
+  try {} catch {
     // Мост НЕ должен ломать первый рендер UI
   }
killedBy: Telegram UI calls ready() if Telegram API is available
statusReason: expected "vi.fn()" to be called at least once

[Survived] BlockStatement
src/infrastructure/utils/tg.ts:33:40
 export function initTelegramUI(): void {
   try {
     // SSR-safe проверка: если окна нет, выходим
-    if (typeof window === 'undefined') {
-      return;
-    }
+    if (typeof window === 'undefined') {}
 
     // Теперь TS знает, что у window есть Telegram, кастовать (as unknown) не нужно!
