[Killed] EqualityOperator
src/application/api/ritual-client.ts:17:21
   const now = Date.now();
 
   // 1. Проверка кэша по TTL
-  if (cachedData && now - lastFetchTime < CACHE_TTL_MS) {
+  if (cachedData && now - lastFetchTime >= CACHE_TTL_MS) {
     console.log('🔄 Возвращаем ритуал из кэша (без запроса к сети)');
     return cachedData;
killedBy: Ritual Client (Caching Strategy) Full flow: fetch -> cache hit -> ttl expire -> network fail -> stale cache
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Survived] ConditionalExpression
src/application/api/ritual-client.ts:23:7
   }
 
   // 2. Искусственный лаг сети (выключен в тестах через NODE_ENV)
-  if (process.env.NODE_ENV !== 'test') {
+  if (false) {
     await new Promise((resolve) => setTimeout(resolve, 400));
   }

[Killed] ArrowFunction
src/application/api/ritual-client.ts:24:23
 
   // 2. Искусственный лаг сети (выключен в тестах через NODE_ENV)
   if (process.env.NODE_ENV !== 'test') {
-    await new Promise((resolve) => setTimeout(resolve, 400));
+    await new Promise(() => undefined);
   }
 
killedBy: Ritual Client (Caching Strategy) applies artificial network lag when NODE_ENV is not "test"
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
