[Killed] ConditionalExpression
src/application/bookmarks.ts:18:70
       has: (id) => get().ids.includes(id),
       // 🛡️ L4 Fix: Проверяем наличие перед добавлением
       add: (id) => set((state) => (state.ids.includes(id) ? state : { ids: [...state.ids, id] })),
-      remove: (id) => set((state) => ({ ids: state.ids.filter((i) => i !== id) })),
+      remove: (id) => set((state) => ({ ids: state.ids.filter((i) => true) })),
     }),
     { name: 'bookmarks-storage' },
killedBy: Bookmarks Store removes item
statusReason: expected [ 'id-1' ] to deeply equal []
