[Killed] BooleanLiteral
src/application/ritual-store.ts:23:40
 
     try {
       const data = await getRitualCached();
-      set({ ritualItem: data, loading: false });
+      set({ ritualItem: data, loading: true });
     } catch (err) {
       console.error('Store Error:', err);
killedBy: Ritual Store fetches ritual successfully
statusReason: expected true to be false // Object.is equality
