[Killed] MethodExpression
src/domain/ritual-schema.ts:8:9
   id: z.string().min(1),
   title: z.string().min(3),
   motivation: z.string().min(5),
-  task: z.string().min(3),
+  task: z.string().max(3),
   affirmation: z.string().min(3),
   imagePrompt: z.string().optional(),
killedBy: Ritual Client (Caching Strategy) Full flow: fetch -> cache hit -> ttl expire -> network fail -> stale cache
statusReason: Не удалось загрузить ритуал. Проверьте связь с космосом.
