[Killed] BlockStatement
src/infrastructure/storage.ts:10:36
       return null; // parse/JSON/localStorage error → тихий фолбэк
     }
   },
-  set(key: string, value: unknown) {
-    try {
-      localStorage.setItem(key, JSON.stringify(value));
-    } catch {
-      void 0; // quota/offline — игнорируем
-    }
-  },
+  set(key: string, value: unknown) {},
   del(key: string) {
     try {
killedBy: Infrastructure: storage should set and get a value
statusReason: expected null to deeply equal { id: 1, name: 'test' }
