[Killed] ConditionalExpression
src/infrastructure/tts.ts:5:3
 
 // Безопасная ссылка на SpeechSynthesis (в браузере)
 const synth: SpeechSynthesis | null =
-  typeof window !== 'undefined' &&
-  // biome-ignore lint/security/noSecrets: 'speechSynthesis' — имя Web API, а не секрет
-  'speechSynthesis' in window
+  false
     ? window.speechSynthesis
     : null;
killedBy: application TTS integration (mutation) uses window.speechSynthesis and builds correct utterance text
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/infrastructure/tts.ts:13:10
 
 /** Проверка поддержки Web Speech API (TTS) */
 export function isSupported(): boolean {
-  return !!synth;
+  return !synth;
 }
 
killedBy: application TTS integration (mutation) returns false and stays safe when speech synthesis is unavailable
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/tts.ts:41:7
   const body = html.replace(/<[^>]*>/g, '').trim();
   const text = (title ? `${title}. ` : '') + body;
 
-  if (!text) {
+  if (false) {
     return;
   }
killedBy: application TTS integration (mutation) does not call speak when cleaned text is empty
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      FakeUtterance {

[Killed] BlockStatement
src/infrastructure/tts.ts:48:7
   const utter = new SpeechSynthesisUtterance(text);
   // Настройка голоса (если требуется)
 
-  try {
-    synth.speak(utter);
-  } catch (error) {
+  try {} catch (error) {
     console.error('TTS error during speak:', error);
   }
killedBy: application TTS integration (mutation) uses window.speechSynthesis and builds correct utterance text
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times
