[Killed] BlockStatement
src/infrastructure/utils/nav.ts:29:36
   if (typeof window !== 'undefined') {
     try {
       const win = window.open(url, '_blank', 'noopener,noreferrer');
-      if (!win && window.location) {
-        window.location.assign(url);
-      }
+      if (!win && window.location) {}
     } catch {
       // Игнорируем ошибки открытия ссылок
killedBy: openLink should fallback to location.assign when window.open returns null
statusReason: expected "vi.fn()" to be called with arguments: [ 'https://example.com' ]

Number of calls: 0
