[Killed] ConditionalExpression
src/infrastructure/utils/reportError.ts:3:20
 // src/utils/reportError.ts
 export async function reportError(err: unknown, meta: Record<string, unknown> = {}) {
-  const safeMeta = meta && typeof meta === 'object' ? meta : {};
+  const safeMeta = false ? meta : {};
 
   const payload = {
killedBy: reportError (branches) swallows fetch failures (catch branch) and still serializes Error properly
statusReason: expected {} to deeply equal { context: 'branch-catch' }

[Killed] ConditionalExpression
src/infrastructure/utils/reportError.ts:3:28
 // src/utils/reportError.ts
 export async function reportError(err: unknown, meta: Record<string, unknown> = {}) {
-  const safeMeta = meta && typeof meta === 'object' ? meta : {};
+  const safeMeta = meta && true ? meta : {};
 
   const payload = {
killedBy: reportError (branches) handles non-Error input and non-object meta (coerces to {})
statusReason: expected 'not-an-object' to deeply equal {}

[Killed] BlockStatement
src/infrastructure/utils/reportError.ts:13:7
     url: typeof location !== 'undefined' ? location.href : undefined,
   };
 
-  try {
-    await fetch('/api/report-error', {
-      method: 'POST',
-      headers: { 'content-type': 'application/json' },
-      body: JSON.stringify(payload),
-    });
-  } catch {
+  try {} catch {
     // не роняем клиент из-за телеметрии
   }
killedBy: reportError (edgecases to 100%) serializes Error when UA/URL are absent
statusReason: expected "fetch" to be called 1 times, but got 0 times
