[Survived] MethodExpression
src/infrastructure/utils/share.ts:76:18
 
 export function normalizeShareUrl(raw: string, canonicalUrl?: string): string {
   try {
-    const base = canonicalUrl?.trim() || raw;
+    const base = canonicalUrl || raw;
 
     try {

[Killed] LogicalOperator
src/infrastructure/utils/share.ts:85:9
       const url = new URL(base, __hrefOrExample());
       const pathname = url.pathname;
       if (
-        pathname.includes('%3A') ||
-        pathname.includes('%2E') ||
-        /[^a-zA-Z0-9\-._~!$&'()*+,;=:@/?%]/.test(decodeURIComponent(pathname))
+        (pathname.includes('%3A') || pathname.includes('%2E')) && /[^a-zA-Z0-9\-._~!$&'()*+,;=:@/?%]/.test(decodeURIComponent(pathname))
       ) {
         return '';
killedBy: normalizeShareUrl returns empty for garbage input
statusReason: expected 'https://app.example.com/current/:::::…' to be '' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/utils/share.ts:85:9
       const url = new URL(base, __hrefOrExample());
       const pathname = url.pathname;
       if (
-        pathname.includes('%3A') ||
-        pathname.includes('%2E') ||
+        false ||
         /[^a-zA-Z0-9\-._~!$&'()*+,;=:@/?%]/.test(decodeURIComponent(pathname))
       ) {
killedBy: path validation tests returns empty for invalid path characters
statusReason: expected 'https://app.example.com/%3A%3A%3A' to be '' // Object.is equality

[Killed] BlockStatement
src/infrastructure/utils/share.ts:88:9
         pathname.includes('%3A') ||
         pathname.includes('%2E') ||
         /[^a-zA-Z0-9\-._~!$&'()*+,;=:@/?%]/.test(decodeURIComponent(pathname))
-      ) {
-        return '';
-      }
+      ) {}
       return stripParams(url).toString();
     }
killedBy: normalizeShareUrl returns empty for garbage input
statusReason: expected 'https://app.example.com/current/:::::…' to be '' // Object.is equality

[Killed] BlockStatement
src/infrastructure/utils/share.ts:128:7
   }
 
   // 2) Web Share API
-  try {
-    if (nav.share) {
-      await nav.share({ url: finalShareUrl, title });
-      return true;
-    }
-  } catch {
+  try {} catch {
     /* ignore */
   }
killedBy: shareLink uses Web Share API when Telegram not available
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/utils/share.ts:138:7
   }
 
   // 3) Clipboard API
-  try {
-    if (navigator.clipboard?.writeText) {
-      await navigator.clipboard.writeText(finalShareUrl);
-      tg?.showPopup?.({
-        title: 'Скопировано',
-        message: 'Ссылка скопирована в буфер обмена.',
-        buttons: [{ type: 'ok' }],
-      });
-      return true;
-    }
-  } catch {
+  try {} catch {
     /* ignore */
   }
killedBy: shareLink uses clipboard when other methods fail
statusReason: expected "vi.fn()" to be called with arguments: [ 'https://example.com/' ]

Number of calls: 0

[Survived] OptionalChaining
src/infrastructure/utils/share.ts:139:9
 
   // 3) Clipboard API
   try {
-    if (navigator.clipboard?.writeText) {
+    if (navigator.clipboard.writeText) {
       await navigator.clipboard.writeText(finalShareUrl);
       tg?.showPopup?.({
