[Survived] ConditionalExpression
src/infrastructure/utils/tg.ts:33:9
 export function initTelegramUI(): void {
   try {
     // SSR-safe проверка: если окна нет, выходим
-    if (typeof window === 'undefined') {
+    if (false) {
       return;
     }
