[Killed] BooleanLiteral
src/infrastructure/utils/useTTSState.ts:18:23
         await speakFromHtml(title, html);
       } finally {
         // даже если ошибка/прерывание — вернуть кнопку в исходное состояние
-        setIsSpeaking(false);
+        setIsSpeaking(true);
       }
     },
killedBy: useTTSState mutation start delegates to speakFromHtml when supported and resets isSpeaking after completion
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/infrastructure/utils/useTTSState.ts:30:13
   }, []);
 
   // На размонтировании / смене экрана — гарантированно остановим озвучку
-  useEffect(() => () => stop(), []);
+  useEffect(() => undefined, []);
 
   return { canTTS, isSpeaking, start, halt };
killedBy: useTTSState mutation halt and unmount call stop to ensure playback is halted
statusReason: expected 1 to be greater than 1
