[Killed] ArrowFunction
src/ui/RitualCard.tsx:12:18
   const { has, add, remove } = useBookmarks();
   const isBookmarked = has(item.id);
 
-  const toggle = () => (isBookmarked ? remove(item.id) : add(item.id));
+  const toggle = () => undefined;
 
   return (
killedBy: RitualCard (Behavior) вызывает add(id), если ритуал еще не в избранном
statusReason: expected "vi.fn()" to be called with arguments: [ 'ritual-123' ]

Number of calls: 0
