[Killed] BlockStatement
src/infrastructure/utils/usePersistentState.ts:4:64
 // src/utils/usePersistentState.ts
 import { useEffect, useState } from 'react';
 
-export function usePersistentState<T>(key: string, initial: T) {
-  const [value, setValue] = useState<T>(() => {
-    try {
-      const saved = localStorage.getItem(key);
-      return saved ? (JSON.parse(saved) as T) : initial;
-    } catch {
-      // ignore read errors
-      return initial;
-    }
-  });
-
-  useEffect(() => {
-    try {
-      localStorage.setItem(key, JSON.stringify(value));
-    } catch {
-      // ignore write errors
-    }
-  }, [key, value]);
-
-  return [value, setValue] as const;
-}
+export function usePersistentState<T>(key: string, initial: T) {}
 
killedBy: usePersistentState mutation returns initial value when storage is empty
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/infrastructure/utils/usePersistentState.ts:15:19
     }
   });
 
-  useEffect(() => {
-    try {
-      localStorage.setItem(key, JSON.stringify(value));
-    } catch {
-      // ignore write errors
-    }
-  }, [key, value]);
+  useEffect(() => {}, [key, value]);
 
   return [value, setValue] as const;
killedBy: usePersistentState mutation writes updated value to localStorage
statusReason: expected "vi.fn()" to be called with arguments: [ 'ritual:persistent', '"updated"' ]

Received: 

  1st vi.fn() call:

  [
    "ritual:persistent",
