[Killed] BlockStatement
src/ui/AppShell.tsx:11:19
 export default function AppShell() {
   const { ritualItem, error, loading, fetchRitual } = useRitualStore();
 
-  useEffect(() => {
-    fetchRitual();
-  }, [fetchRitual]);
+  useEffect(() => {}, [fetchRitual]);
 
   // Простой вывод ошибки без лишних компонентов
killedBy: AppShell (Mutation Coverage - useEffect) calls fetchRitual immediately on mount (kills useEffect body mutation)
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/ui/AppShell.tsx:36:10
     <div className="min-h-screen bg-gradient-to-br from-purple-900 via-blue-900 to-indigo-900 text-white">
       <Header title="Prisma Ritual AI" />
       <main className="container mx-auto px-4 py-12">
-        {loading && <div className="text-center text-3xl animate-pulse">Загрузка...</div>}
+        {false}
         {!loading && ritualItem && <RitualCard item={ritualItem} />}
       </main>
killedBy: AppShell Integration показывает загрузку
statusReason: Unable to find an element with the text: /Загрузка.../i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="min-h-screen bg-gradient-to-br from-purple-900 via-blue-900 to-indigo-900 text-white"
    >
